Terraform Format and Style 🖌  `success`
Terraform Initialization ⚙️  `success`
Terraform Validation 🤖  `success`
Terraform Plan 📖  `success`

<details><summary>Show Plan</summary>

```

aws_ecr_repository.http_echo: Refreshing state... [id=http-echo]
data.aws_iam_policy_document.node_trust: Reading...
module.eks_vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f232e7798af33585]
data.aws_iam_policy_document.node_trust: Read complete after 0s [id=1903849331]
data.aws_iam_policy_document.cluster_trust: Reading...
module.eks_vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0dd9f5904bc3f1024]
aws_iam_role.eks_node: Refreshing state... [id=eks-node]
data.aws_iam_policy_document.cluster_trust: Read complete after 0s [id=189502314]
aws_iam_role.eks_cluster: Refreshing state... [id=eks-cluster]
aws_iam_role_policy_attachment.node_cni: Refreshing state... [id=eks-node-20230416171857435900000003]
aws_iam_role_policy_attachment.node_worker: Refreshing state... [id=eks-node-20230416171857492200000004]
aws_iam_role_policy_attachment.node_ecr: Refreshing state... [id=eks-node-20230416171857278600000001]
aws_iam_role_policy_attachment.cluster_eks: Refreshing state... [id=eks-cluster-20230416171857334800000002]
module.eks_vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-063bc2c87a79aa783]
module.eks_vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-005ab71161473d90f]
module.eks_vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-02bdea87b899ed4b7]
module.eks_vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-01c92c57a5d8f11c1]
module.eks_vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0753583866450d952]
module.eks_vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-01c5582125855541a]
module.eks_vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0cb30fb21363f7124]
module.eks_vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-019c7c45b9eac0d64]
module.eks_vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-03497688032e68848]
module.eks_vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01c92c57a5d8f11c11080289494]
module.eks_vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0240c68ca4fcdd317]
module.eks_vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0abdaeea95ace63d8]
aws_eks_cluster.green: Refreshing state... [id=green]
module.eks_vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e548f80b55b0ff4d]
module.eks_vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01afba7e91e003736]
module.eks_vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0cb30fb21363f71241080289494]
aws_eks_node_group.spot_small: Refreshing state... [id=green:spot-small]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecr_repository.http_echo will be updated in-place
  ~ resource "aws_ecr_repository" "http_echo" {
        id                   = "http-echo"
      ~ image_tag_mutability = "MUTABLE" -> "IMMUTABLE"
        name                 = "http-echo"
        tags                 = {}
        # (4 unchanged attributes hidden)

      ~ image_scanning_configuration {
          ~ scan_on_push = false -> true
        }

        # (1 unchanged block hidden)
    }

  # module.eks_vpc.aws_flow_log.this[0] will be created
  + resource "aws_flow_log" "this" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags_all                 = {
          + "Managed_by" = "terraform"
          + "Repository" = "github.com/octaviobr/docker-http-echo"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-0dd9f5904bc3f1024"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
Pushed by: @OctavioBR